/* ---------------------------------------------------------------------------
 * @
 *						УТИЛИТА ДЕМОНСТРИРУЮЩАЯ ВЛИЯНИЕ
 *		ВЫРАВНИВАНИЯ АДРЕСОВ НА СКОРОСТЬ КОПИРОВАНИЯ БОЛЬШИХ БЛОКОВ ПАМЯТИ
 *		==================================================================
 *
 * Build 0x001 06.07.2002
--------------------------------------------------------------------------- */
// конфигурация
#define BLOCK_SIZE		(8*M)				// размер копируемого блока


#include <DoCPU.h>
main()
{
	char *p1, *p2;

	// TITLE
	PRINT("= = = влияние выравнивния адресов на скорость копирования памяти = = =\n");
	PRINT_TITLE;

	// выделение памяти
	p1 = malloc(BLOCK_SIZE);
	p2 = malloc(BLOCK_SIZE);


	/*------------------------------------------------------------------------
	 *
	 *					копирование выровненного блока
	 *
	----------------------------------------------------------------------- */
	VVV;
	A_BEGIN(0)
		memcpy(p2, p1, BLOCK_SIZE);
	A_END(0)

	/*------------------------------------------------------------------------
	 *
	 *				копирование блока c невыровненным приемником
	 *
	----------------------------------------------------------------------- */
	VVV;
	A_BEGIN(1)
		memcpy(p2 + 1, p1, BLOCK_SIZE);
	A_END(1)

	/*------------------------------------------------------------------------
	 *
	 *				копирование блока c невыровненным источником
	 *
	----------------------------------------------------------------------- */
	VVV;
	A_BEGIN(2)
		memcpy(p2, p1 + 1, BLOCK_SIZE);
	A_END(2)

	/*------------------------------------------------------------------------
	 *
	 *				копирование целиком невыровненного блока
	 *
	----------------------------------------------------------------------- */
	VVV;
	A_BEGIN(3)
		memcpy(p2 + 1, p1 + 1, BLOCK_SIZE);
	A_END(3)

	// вывод результатов
	Lx_OUT("unalign dst......",Ax_GET(0),Ax_GET(1));
	Lx_OUT("unalign src......",Ax_GET(0),Ax_GET(2));
	Lx_OUT("unalign src & dst",Ax_GET(0),Ax_GET(3));
}

_P_S()
{
/*
	"Уже давно 
	Утихло поле боя, 

	Но сорок тысяч 
	Воинов Китая 
	Погибли здесь, 
	Пожертвовав собою..."

	Ду Фо "Оплакиваю поражение при Чэньтао"
*/
}
