/* ---------------------------------------------------------------------------
 * @
 *					ДЕМОНСТРАЦИЯ ЭФФЕКТИВНОСТИ
 *				АЛГОРИТМА	ЛИНЕЙНОЙ	СОРТИРОВКИ
 *				==================================
 *
 * Build 0x001 04.05.2002
-------------------------------------------------------------------------- */
// конфигураци
#define N_MAX	10000000

#define VAL_MAX	1000		// макс. допустмое значение сортируемых элементов
#define _NORDTSC			// для измерения больших временных интервалов

#include <DoCPU.h>


/* ---------------------------------------------------------------------------
 *
 *				ЛИНЕЙНАЯ СОРТИРОВКА n ЭЛЕМЕНТОВ МАССИВА p
 *
--------------------------------------------------------------------------- */
int* linear_sort(int *p, int n)
{
	int a, b;
	int count = 0;
	int *virtual_a;					// массив для сортировки

	// выделяем память
	virtual_a = malloc(VAL_MAX*sizeof(int));
	if (!virtual_a) /* недостаточно памяти */ return 0;

	// init
	memset(virtual_a, 0, VAL_MAX*sizeof(int));

	// сортировка
	for(a = 0; a < n; a++)
		virtual_a[p[a]]++;

	// формирование ответа
	for(a = 0; a < VAL_MAX; a++)
		for(b = 0; b < virtual_a[a]; b++)
			p[count++]=a;

	// освобрждаем память
	free(virtual_a);

	return p;
}


/*----------------------------------------------------------------------------
 *
 *							ФУНКЦИЯ СРАВНЕНИЯ ДЛЯ QSORT
 *
--------------------------------------------------------------------------- */
int compare( const void *arg1, const void *arg2 )
{
	return *(int *)arg2 - *(int *)arg1;
}


/*----------------------------------------------------------------------------
 * 
 *				СОРТИРОВКА N ЧИСЕЛ РАЗЛИЧНЫМИ МЕТОДАЫМИ И СРАВНЕНИЕ
 *
--------------------------------------------------------------------------- */
vs(int *p_array, int *p_src, int N)
{
	int a;
	char buf[MAX_STR_LEN];
	#define FORCE ((N>500000)?1:0)

	VVV
	// qsort
	AL_BEGIN
		memcpy(p_array,p_src,N*sizeof(int));
		UL_BEGIN(0, FORCE)
			qsort( (void *)p_array, N, sizeof(int), compare);
		UL_END(0, FORCE)
		VVV;
	AL_END

	// linear sort
	AL_BEGIN
		memcpy(p_array,p_src, N*sizeof(int));
		UL_BEGIN(1, FORCE)
			linear_sort(p_array, N);
		UL_END(1, FORCE)
		VVV
	AL_END
	sprintf(buf,"N %8d %4.5f %4.5f",N,cpu2timeu(Ax_GET(0),FORCE), cpu2timeu(Ax_GET(1),FORCE));
	PRINT(buf);	Lx_OUT("",Ax_GET(0),Ax_GET(1));
}

main()
{
	int a;
	int *p_src, *p_array;

	// TITLE
	PRINT("= = = демонстрация превосходства linear_sort над qsort = = =\n");
	PRINT_TITLE;

	// выделяем память
	p_src	= malloc(N_MAX*sizeof(int));
	p_array	= malloc(N_MAX*sizeof(int));

	// подготавливаем массив сортируемых чисел
	for (a = 0; a < N_MAX; a++)
		p_src[a]=rand() % VAL_MAX;

	#define VS(N) if(N>N_MAX) {PRINT("-ERR:too big\n");return -1;} else vs(p_array, p_src, N);

	printf(_TEXT("чисел сорт tmime qsort/linear(сек.) превосходство\n"));

	// СОРТИРОВКА 100 ЧИСЕЛ
	VS(100)

	// СОРТИРОВКА 1.000 ЧИСЕЛ
	VS(1000)

	// СОРТИРОВКА 10.000 ЧИСЕЛ
	VS(10000)

	// СОРТИРОВКА 100.000 ЧИСЕЛ
	VS(100000)

	// СОРТИРОВКА 1.000.000 ЧИСЕЛ
	VS(1000000)

	// СОРТИРОВКА 10.000.000 ЧИСЕЛ
	VS(10000000)

	return 0;
}



_P_S()
{
/*
	"Я  смотрел  на танцовщиц, которые танцуют. Танец придуман, станцован. Кто
	может   воспользоваться   им,  унести и  превратить в  припас  на будущее?
	Он  миновал,  как   пожар.  Но я назову  благородным народ, танцующий свои
	танцы,  хоть нет  для  них ни закромов, ни житниц. А  тех, кто расставляет
	по   полкам   прекраснейшие  творения  чужих  рук,  несмотря   на   умение
	восхищаться, я назову варваром"
									Антуан де Сент-Экзюпери. Цитадель
*/
}
