/* ---------------------------------------------------------------------------
 * @
 *					”“»Ћ»“ј ƒ≈ћќЌ—“–»–”ёўјя
 *			Ё‘‘≈ “»¬Ќќ—“№ —ѕ≈ ”Ћя“»¬Ќќ… «ј√–”« » ƒјЌЌџ’
 *			===========================================
 *
 * Build 0x001 30.06.2002
--------------------------------------------------------------------------- */
// конфигураци€
#define BLOCK_SIZE	(4*M)

#include <DoCPU.h>
main()
{
		int a;
		int x = 0;
		int y = 0;
		int *p;

		PRINT("= = = демонстраци€ эфффективности спекул€тивной загрузки данных = = =");
		PRINT_TITLE;

		// выдел€ем пам€ть
		p = malloc(BLOCK_SIZE);

		// иницилизируем 
		memset(p, 6, BLOCK_SIZE);

		/*--------------------------------------------------------------------
		 *
		 *					неоптимизированный вариант
		 *
		------------------------------------------------------------------- */
		VVV;
		A_BEGIN(0)
		for(a = 0; a < BLOCK_SIZE; a += 32)
		{
			// загружаем €чейки
			x += (*(int *)((char *) p + a));
			x += (*(int *)((char *) p + a + 4));
			x += (*(int *)((char *) p + a + 8));
			x += (*(int *)((char *) p + a + 12));
			x += (*(int *)((char *) p + a + 16));
			x += (*(int *)((char *) p + a + 20));
			x += (*(int *)((char *) p + a + 24));
			x += (*(int *)((char *) p + a + 28));

			// выполн€ем некоторые вычислени€
			x += a/x/666;
		}
		A_END(0)

		/*--------------------------------------------------------------------
		 *
		 *					оптимизированный вариант
		 *				   со спекул€тивной загрузкой
		 *
		------------------------------------------------------------------- */
		VVV;
		A_BEGIN(1)
		// загружаем первую порцию данных
		x += (*(int *)((char *) p + a));
		for(a = 0; a < BLOCK_SIZE; a += 32)
		{
			// упреждающа€ загрузка очередной порции данных
			y = (*(int *)((char *) p + a + 32));

			// обрабатываем ранее загруженные €чейки
			x += (*(int *)((char *) p + a + 4));
			x += (*(int *)((char *) p + a + 8));
			x += (*(int *)((char *) p + a + 12));
			x += (*(int *)((char *) p + a + 16));
			x += (*(int *)((char *) p + a + 20));
			x += (*(int *)((char *) p + a + 24));
			x += (*(int *)((char *) p + a + 28));
			
			// выполн€ем некоторые выичлени€
			x += a/x/666;

			// востребуем упреженно загруженные данные
			x += y;
		}
		A_END(1)

		// вывод результатов на консоль
		Lx_OUT("Speculative read",Ax_GET(0),Ax_GET(1));
		//printf("%f\n%f\n",BLOCK_SIZE/cpu2time(Ax_GET(0)),
		//BLOCK_SIZE/cpu2time(Ax_GET(1)));

		return x;
}


_P_S()
{
/*
	"...племена,  что  довольствуютс€  чужими  сказани€ми,  ед€т  чужой хлеб и
	нанимают  за  деньги  архитекторов,  жела€  построить себе город, достойны
	презрени€.  я  называю их сто€чим болотом. » не вижу над ними золот€щегос€
	ореола  пылинок,  поднимающихс€  при  молотьбе"
											јнтуан  де —ент-Ёкзюпери.÷итадель
*/
}
