/* ---------------------------------------------------------------------------
 * @
 *							”“»Ћ»“ј ƒЋя ќ÷≈Ќ »
 *		¬Ћ»яЌ≈Ќ»я Ќј ѕ–ќ»«¬ќƒ»“≈Ћ№Ќќ—“№ ѕ≈–≈ –џ“»я “–јЌ«ј÷»я „“≈Ќ»я/«јѕ»—»
 *		==================================================================
 *
 * Build 0x001 30.06.2002
--------------------------------------------------------------------------- */

//  ќЌ‘»√”–ј÷»я
#define BLOCK_SIZE	(128*K)						// размер обрабатываемого блока

#include <DoCPU.h>
main()
{
	int a;
	int x = 0, y = 0;
	int *p1, *p2;

	// TITLE
	PRINT("= = = вли€нение на производительность перкрыти€ тразакций чтени€/записи = = =\n");
	PRINT_TITLE;

	// выделение пам€ти
	p1 = malloc(BLOCK_SIZE);
	p2 = malloc(BLOCK_SIZE);

	/* -----------------------------------------------------------------------
	 *
	 *			транзакции на чтение и запись _не_ перекрываютс€
	 *				вли€ние разворота цикла не учтено
	 *
	----------------------------------------------------------------------- */
	VVV;
	A_BEGIN(0)
		// чтение
		for (a = 0; a < BLOCK_SIZE; a += 4)
				x += *(int *)((char *)p1 + a);

		// запись
		for (a = 4; a < BLOCK_SIZE; a += 4)
			*(int *)((char *)p2 + a) = y;
	A_END(0)


	/* -----------------------------------------------------------------------
	 *
	 *			транзакции на чтение и запись _перекрываютс€_
	 *				вли€ние разворота цикла не учтено
	 *
	----------------------------------------------------------------------- */
	VVV;
	A_BEGIN(1)
		for (a = 0; a < BLOCK_SIZE; a += 4)
		{
			// чтение
			x += *(int *)((char *)p1 + a);

			// запись
			*(int *)((char *)p2 + a + 4) = y;
		}
	A_END(1)


	/* -----------------------------------------------------------------------
	 *
	 *			транзакции на чтение и запись _не_ перекрываютс€
	 *					вли€ние разворота цикла учтено
	 *
	----------------------------------------------------------------------- */
	VVV;
	A_BEGIN(2)
		// чтение
		for (a = 0; a < BLOCK_SIZE; a += 32)
		{
			x += *(int *)((char *)p1 + a);
			x += *(int *)((char *)p1 + a + 4);
			x += *(int *)((char *)p1 + a + 8);
			x += *(int *)((char *)p1 + a + 12);
			x += *(int *)((char *)p1 + a + 16);
			x += *(int *)((char *)p1 + a + 20);
			x += *(int *)((char *)p1 + a + 24);
			x += *(int *)((char *)p1 + a + 28);
		}

		// запись
		for (a = 4; a < BLOCK_SIZE; a += 32)
		{
			*(int *)((char *)p2 + a) = y;
			*(int *)((char *)p2 + a + 4) = y;
			*(int *)((char *)p2 + a + 8) = y;
			*(int *)((char *)p2 + a + 12) = y;
			*(int *)((char *)p2 + a + 16) = y;
			*(int *)((char *)p2 + a + 20) = y;
			*(int *)((char *)p2 + a + 24) = y;
			*(int *)((char *)p2 + a + 28) = y;
		}
	A_END(2)


	/* -----------------------------------------------------------------------

				транзакции на чтение и запись _перекрываютс€_
						вли€ние разворота цикла учтено

	----------------------------------------------------------------------- */
	VVV;
	A_BEGIN(3)
		for (a = 0; a < BLOCK_SIZE; a += 16)
		{
			// чтение
			x += *(int *)((char *)p1 + a);
			x += *(int *)((char *)p1 + a + 4);
			x += *(int *)((char *)p1 + a + 8);
			x += *(int *)((char *)p1 + a + 12);

			// запись
			*(int *)((char *)p2 + a) = y;
			*(int *)((char *)p2 + a + 4) = y;
			*(int *)((char *)p2 + a + 8) = y;
			*(int *)((char *)p2 + a + 12) = y;
		}
	A_END(3)

	// вывод результатов на консоль
	Lx_OUT("без разворота цикла",Ax_GET(0),Ax_GET(1));
	Lx_OUT("с разворотом  цикла",Ax_GET(2),Ax_GET(3));
}

_P_S()
{
/*
	"...волны    пам€ти   беред€т  сознание,  омывают  пережитым,  вздымаютс€,
	опадают,  принос€т   и  унос€т  камешки  воспоминаний,  звучащие  раковины
	голосов,  дот€нулись,   раскачали  сердце, и,словно нити водорослей, ожили
	сердечные прив€занности"
										јнтуан де —ент-Ёкзюпери. ÷итадель
*/
}