/* ---------------------------------------------------------------------------
 *
 *			ƒ≈ћќЌ—“–ј÷»я —јћќѕ–ќ»«¬ќЋ№Ќќ… ¬џ√–”« » Ѕ”‘≈–ќ¬ «јѕ»—»
 *			=====================================================
 *
 * Build 0x001 08.08.2002
--------------------------------------------------------------------------- */
#include <DoCPU.h>

#include "store_buff.h"			// h-файл автоматически генерируетс€ make
								// файлом и содержит определение N_ITER,
								// обозначающее кол-во итераций записи

main()
{
	int		*p;
	int		a, b;
	int		*buff;

	// выдел€ем пам€ть
	p = (int *) malloc(1*M);

	// спим, чтобы попасть точно в отведенный нам квант времени
	Sleep(100);
	
	// вызываем store_buf.xm
	buff = DoCPU(&p);

	// выводим результаты замеров на экран
	printf("%d",N_ITER);for(a = 0; a < 10; a++) printf("\t%d",buff[a]);
	printf("\n");

}
