; /*--------------------------------------------------------------------------
;  *
;  *			ј——≈ћЅЋ≈–Ќјя –≈јЋ»«ј÷»я ѕ–ќ÷≈ƒ”–џ  ќѕ»–ќ¬јЌ»я ѕјћя“»
;  *
; ------------------------------------------------------------------------- */
.386
.MODEL FLAT
.CODE

_asm_cpy	proc
	PUSH ESI						; \
	PUSH EDI						;  +- сохран€ем регистры
	PUSH ECX						; /

	MOV	ESI, [ESP +  4 + 3*4]		; готовим src
	MOV	EDI, [ESP +  8 + 3*4]		; готовим dst
	MOV	ECX, [ESP + 12 + 3*4]		; готовим n

									; типа копируем ;)
	REP MOVSD						; src ---n---> dst

	POP ECX							; \
	POP EDI							;  +- восстанавливаем регистры
	POP ESI							; /

	ret								; возвращаемс€ из процедуры
_asm_cpy endp
END


