/*----------------------------------------------------------------------------
 *
 *				ПРИМЕР, ДЕМОНСТРИРУЮЩИЙ НЕПОСТОЯНСТВО
 *			времени			обработки	блока		памяти
 *			==============================================
 *
 * Build 0x001 16.08.2002
----------------------------------------------------------------------------*/
//#define __OVER_BRANCH__
// ^^^^ раскомментируйте это для активиации "гипер-ветвлений"
// и насыщения блока предсказания ветвлений для очистки результата
// от вновимых им искажений
#include <DoCPU.h>
#define	BLOCK_SIZE	_NORMAL

main()
{
	int		*p;
	int		x = 0;

	#define	a (int *)((char *)p + x)
	#define	b (int *)((char *)p + BLOCK_SIZE - x)

	p = (int *) malloc(BLOCK_SIZE);

	PRINT_TITLE; PRINT(("= = = демонстрация непостоянсва времени обработки блока памяти = = =\n"));

	A_BEGIN(0)
		for (x = 0; x < BLOCK_SIZE/2; x += sizeof(int))
		{	
			#ifdef __OVER_BRANCH__
				if (x & 1)
			#endif
				*a = *a^*b; *b = *b^*a; *a = *a^*b;
		}
	A_END(0)

	// вывод результатов всех замеров на экран
	A_LIST_ITER(0)
}