/*----------------------------------------------------------------------------
 *
 *						ТЕСТОВЫЙ СТЕНД ДЛЯ ИЗМЕРЕНИЯ
 *			ВРЕНМЕНИ ВЫПОЛНЕНИЯ ОТДЕЛЬНЫХ МАШИННЫХ КОМАНД
 *			==============================================
 *
 * Build 0x001 16.08.2002
----------------------------------------------------------------------------*/
#include <DoCPU.h>

main()
{
	int		a;
	int		*p;

	PRINT("= = = измерение времени выполнения отдельных машинных команд = = =\n");
	PRINT_TITLE;

	// вызов test.mod
	p=DoCPU(0);

	// вывод результатов замеров на консоль
	printf("{ // see test.mod \n");
		for (a = 0; a < 10; a++) printf("\tpass %d, CPU clock %d\n", a, p[a]);
	printf("}\n");
}